import React from "react";

import Header from "./header";
import ContactUs from "@/components/shared/contact-us/page";
import FirstChild from "./first-child";
import SecondChild from "./second-child";
import ThirdChild from "./third-child";
import FAQ from "@/components/shared/FAQ/page";

interface Questiontype {
  id: number;
  title: string;
  text: string;
}
const Network = () => {
  const Questions: Questiontype[] = [
    {
      id: 1,
      title: "هزینه خدمات شبکه چگونه محاسبه می شود؟",
      text: ` هزینه خدمات شبکه به چندین عامل مختلف بستگی دارد. ابتدا نوع خدمات مورد
      نیاز شما تعیین‌کننده است؛ خدماتی مانند نصب و پیکربندی، پشتیبانی، امنیت
      شبکه و غیره هر کدام هزینه‌های متفاوتی دارند. پیچیدگی پروژه نیز نقش
      مهمی ایفا می‌کند؛ عواملی مانند تعداد دستگاه‌ها، کاربران و وسعت شبکه
      می‌تواند هزینه را تحت تأثیر قرار دهد. همچنین، اگر نیاز به تجهیزات جدید
      باشد، هزینه‌های مربوط به تجهیزات به هزینه‌های خدمات اضافه می‌شود. مدت
      زمان و نوع قرارداد (مثلاً قراردادهای ماهانه یا سالانه) و همچنین محل
      فیزیکی شرکت یا سازمان شما و نیاز به اعزام کارشناس به محل نیز از دیگر
      عواملی هستند که هزینه را تعیین می‌کنند. برای دریافت تخمین دقیق‌تر و
      ارزیابی هزینه‌ها بر اساس نیازها و شرایط خاص شما، می‌توانید با
      کارشناسان ما تماس بگیرید تا یک پیشنهاد هزینه مناسب ارائه دهند.`,
    },
    {
      id: 2,
      title: "هزینه خدمات شبکه چگونه محاسبه می شود؟",
      text: ` هزینه خدمات شبکه به چندین عامل مختلف بستگی دارد. ابتدا نوع خدمات مورد
          نیاز شما تعیین‌کننده است؛ خدماتی مانند نصب و پیکربندی، پشتیبانی، امنیت
          شبکه و غیره هر کدام هزینه‌های متفاوتی دارند. پیچیدگی پروژه نیز نقش
          مهمی ایفا می‌کند؛ عواملی مانند تعداد دستگاه‌ها، کاربران و وسعت شبکه
          می‌تواند هزینه را تحت تأثیر قرار دهد. همچنین، اگر نیاز به تجهیزات جدید
          باشد، هزینه‌های مربوط به تجهیزات به هزینه‌های خدمات اضافه می‌شود. مدت
          زمان و نوع قرارداد (مثلاً قراردادهای ماهانه یا سالانه) و همچنین محل
          فیزیکی شرکت یا سازمان شما و نیاز به اعزام کارشناس به محل نیز از دیگر
          عواملی هستند که هزینه را تعیین می‌کنند. برای دریافت تخمین دقیق‌تر و
          ارزیابی هزینه‌ها بر اساس نیازها و شرایط خاص شما، می‌توانید با
          کارشناسان ما تماس بگیرید تا یک پیشنهاد هزینه مناسب ارائه دهند.`,
    },
    {
      id: 3,
      title: "هزینه خدمات شبکه چگونه محاسبه می شود؟",
      text: ` هزینه خدمات شبکه به چندین عامل مختلف بستگی دارد. ابتدا نوع خدمات مورد
          نیاز شما تعیین‌کننده است؛ خدماتی مانند نصب و پیکربندی، پشتیبانی، امنیت
          شبکه و غیره هر کدام هزینه‌های متفاوتی دارند. پیچیدگی پروژه نیز نقش
          مهمی ایفا می‌کند؛ عواملی مانند تعداد دستگاه‌ها، کاربران و وسعت شبکه
          می‌تواند هزینه را تحت تأثیر قرار دهد. همچنین، اگر نیاز به تجهیزات جدید
          باشد، هزینه‌های مربوط به تجهیزات به هزینه‌های خدمات اضافه می‌شود. مدت
          زمان و نوع قرارداد (مثلاً قراردادهای ماهانه یا سالانه) و همچنین محل
          فیزیکی شرکت یا سازمان شما و نیاز به اعزام کارشناس به محل نیز از دیگر
          عواملی هستند که هزینه را تعیین می‌کنند. برای دریافت تخمین دقیق‌تر و
          ارزیابی هزینه‌ها بر اساس نیازها و شرایط خاص شما، می‌توانید با
          کارشناسان ما تماس بگیرید تا یک پیشنهاد هزینه مناسب ارائه دهند.`,
    },
    {
      id: 4,
      title: "هزینه خدمات شبکه چگونه محاسبه می شود؟",
      text: ` هزینه خدمات شبکه به چندین عامل مختلف بستگی دارد. ابتدا نوع خدمات مورد
          نیاز شما تعیین‌کننده است؛ خدماتی مانند نصب و پیکربندی، پشتیبانی، امنیت
          شبکه و غیره هر کدام هزینه‌های متفاوتی دارند. پیچیدگی پروژه نیز نقش
          مهمی ایفا می‌کند؛ عواملی مانند تعداد دستگاه‌ها، کاربران و وسعت شبکه
          می‌تواند هزینه را تحت تأثیر قرار دهد. همچنین، اگر نیاز به تجهیزات جدید
          باشد، هزینه‌های مربوط به تجهیزات به هزینه‌های خدمات اضافه می‌شود. مدت
          زمان و نوع قرارداد (مثلاً قراردادهای ماهانه یا سالانه) و همچنین محل
          فیزیکی شرکت یا سازمان شما و نیاز به اعزام کارشناس به محل نیز از دیگر
          عواملی هستند که هزینه را تعیین می‌کنند. برای دریافت تخمین دقیق‌تر و
          ارزیابی هزینه‌ها بر اساس نیازها و شرایط خاص شما، می‌توانید با
          کارشناسان ما تماس بگیرید تا یک پیشنهاد هزینه مناسب ارائه دهند.`,
    },
  ];
  return (
    <div>
      <Header />
      <FirstChild />
      <SecondChild />
      <ThirdChild />
      <FAQ questions={Questions} />
      <ContactUs />
    </div>
  );
};

export default Network;
