import React from "react";

import Header from "./header";
import ContactUs from "@/components/shared/contact-us/page";
import FAQ from "@/components/shared/FAQ/page";
import FirstChild from "./first-child";
import SecondChild from "./second-child";
import ThirdChild from "./third-child";

interface Questiontype {
  id: number;
  title: string;
  text: string;
}
const Web = () => {
  const Questions: Questiontype[] = [
    {
      id: 1,
      title:
        "چگونه می‌توانم پروژه طراحی سایت یا اپلیکیشن خود را با تلمیس آغاز کنم؟",
      text: `برای شروع پروژه خود با تلمیس، می‌توانید از طریق فرم تماس در وبسایت ما یا تماس مستقیم با تیم پشتیبانی، نیازها و جزئیات پروژه خود را با ما در میان بگذارید. تیم ما پس از بررسی و تحلیل اولیه، با شما تماس خواهد گرفت تا مراحل بعدی را به شما توضیح دهد و برنامه‌ریزی لازم برای اجرای پروژه را انجام دهد.`,
    },
    {
      id: 2,
      title:
        "چگونه می‌توانم پروژه طراحی سایت یا اپلیکیشن خود را با تلمیس آغاز کنم؟",
      text: `برای شروع پروژه خود با تلمیس، می‌توانید از طریق فرم تماس در وبسایت ما یا تماس مستقیم با تیم پشتیبانی، نیازها و جزئیات پروژه خود را با ما در میان بگذارید. تیم ما پس از بررسی و تحلیل اولیه، با شما تماس خواهد گرفت تا مراحل بعدی را به شما توضیح دهد و برنامه‌ریزی لازم برای اجرای پروژه را انجام دهد.`,
    },
    {
      id: 3,
      title:
        "چگونه می‌توانم پروژه طراحی سایت یا اپلیکیشن خود را با تلمیس آغاز کنم؟",
      text: `برای شروع پروژه خود با تلمیس، می‌توانید از طریق فرم تماس در وبسایت ما یا تماس مستقیم با تیم پشتیبانی، نیازها و جزئیات پروژه خود را با ما در میان بگذارید. تیم ما پس از بررسی و تحلیل اولیه، با شما تماس خواهد گرفت تا مراحل بعدی را به شما توضیح دهد و برنامه‌ریزی لازم برای اجرای پروژه را انجام دهد.`,
    },
    {
      id: 4,
      title:
        "چگونه می‌توانم پروژه طراحی سایت یا اپلیکیشن خود را با تلمیس آغاز کنم؟",
      text: `برای شروع پروژه خود با تلمیس، می‌توانید از طریق فرم تماس در وبسایت ما یا تماس مستقیم با تیم پشتیبانی، نیازها و جزئیات پروژه خود را با ما در میان بگذارید. تیم ما پس از بررسی و تحلیل اولیه، با شما تماس خواهد گرفت تا مراحل بعدی را به شما توضیح دهد و برنامه‌ریزی لازم برای اجرای پروژه را انجام دهد.`,
    },
  ];

  return (
    <div>
      <Header />
      <FirstChild />
      <SecondChild />
      <ThirdChild />
      <ContactUs />
      <FAQ questions={Questions} />
    </div>
  );
};

export default Web;
